Revit 2024 API
RelinquishOptions Constructor
 Constructs a new instance of RelinquishOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RelinquishOptions(
	bool relinquishEverything
)
Visual Basic
Public Sub New ( _
	relinquishEverything As Boolean _
)
Visual C++
public:
RelinquishOptions(
	bool relinquishEverything
)
Parameters
relinquishEverything
Type: System.Boolean
 The value to apply to all of the members.
See Also
RelinquishOptions Class
Autodesk.Revit.DB Namespace